In [76]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
%matplotlib inline

# Pandas 심화

## 조건으로 검색하기

In [77]:
df = pd.DataFrame(np.random.rand(5,2), columns=['A','B'])
df

          A         B
0  0.511826  0.012920
1  0.532479  0.005414
2  0.056616  0.679509
3  0.293308  0.970662
4  0.169519  0.948838

In [78]:
df['A'] < 0.5

0    False
1    False
2     True
3     True
4     True
Name: A, dtype: bool

In [79]:
A1 = df['A'] < 0.5
df[A1]

          A         B
2  0.056616  0.679509
3  0.293308  0.970662
4  0.169519  0.948838

In [80]:
(df['A']<0.5) & (df['B'] <0.3)

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [81]:
df.query( 'A < 0.5 and B > 0.3')

          A         B
2  0.056616  0.679509
3  0.293308  0.970662
4  0.169519  0.948838

In [82]:
condition = (df['A']<0.5) & (df['B'] <0.3) 
df[condition]

Empty DataFrame
Columns: [A, B]
Index: []

In [83]:
data = {
    'Animal' : ['Dog','Cat','Cat','Pig','Cat'],
    'Name' : ['Happy','Sam','Toby','Mini','Rocky']
}
df = pd.DataFrame(data)
df

  Animal   Name
0    Dog  Happy
1    Cat    Sam
2    Cat   Toby
3    Pig   Mini
4    Cat  Rocky

In [84]:
# contains 
df['Animal'].str.contains('Cat')

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [85]:
# match
df['Animal'].str.match('Cat')

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [86]:
cat = df['Animal'].str.match('Cat')
df[cat]

  Animal   Name
1    Cat    Sam
2    Cat   Toby
4    Cat  Rocky

In [87]:
# 대소문자 상관없이 서치하기 
df['Animal'].str.match('cat', case=False)

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

## 함수로 데이터 처리하기

In [88]:
df = pd.DataFrame( np.arange(5), columns=["Num"])
df1 = df
def square(x):
    return x**2

df['Square'] = df['Num'].apply(square)
df

   Num  Square
0    0       0
1    1       1
2    2       4
3    3       9
4    4      16

In [89]:
df1['Square'] = df['Num'].apply(lambda x : x**2 )
df1

   Num  Square
0    0       0
1    1       1
2    2       4
3    3       9
4    4      16

In [90]:
df = pd.DataFrame(columns=["phone"])
print(df)
df.loc[0] = '010-1234-5678'
print(df)
df.loc[1] = '공일공-일이삼사-오육칠팔'
print(df)
df.loc[2] = '010.1234.일이삼오'
print(df)
df.loc[3] = '공1공-1234.1이3오'
print(df)

Empty DataFrame
Columns: [phone]
Index: []
           phone
0  010-1234-5678
           phone
0  010-1234-5678
1  공일공-일이삼사-오육칠팔
           phone
0  010-1234-5678
1  공일공-일이삼사-오육칠팔
2  010.1234.일이삼오
           phone
0  010-1234-5678
1  공일공-일이삼사-오육칠팔
2  010.1234.일이삼오
3  공1공-1234.1이3오

In [91]:
# 새로운 열 생성
df['preprocess_phone'] = ''
df

           phone preprocess_phone
0  010-1234-5678
1  공일공-일이삼사-오육칠팔
2  010.1234.일이삼오
3  공1공-1234.1이3오

In [92]:
def get_preprocess_phone(phone):
    mapping_dict = {
        '공':'0',
        '일':'1',
        '이':'2',
        '삼':'3',
        '사':'4',
        '오':'5',
        '-': "",
        '.': ""
    }
    for key, value in mapping_dict.items():
        phone = phone.replace(key,value) #key 값을 value 값으로 치환
    return phone

In [93]:
df['preprocess_phone'] = df['phone'].apply(get_preprocess_phone)
df

           phone preprocess_phone
0  010-1234-5678      01012345678
1  공일공-일이삼사-오육칠팔      01012345육칠팔
2  010.1234.일이삼오      01012341235
3  공1공-1234.1이3오      01012341235

In [94]:
sex = {'Sex' : ['Male','Male','Female','Female','Male']}
df = pd.DataFrame(sex)
df

      Sex
0    Male
1    Male
2  Female
3  Female
4    Male

In [95]:
df['Sex'].replace( {'Male':0, 'Female':1} ),df # df 자체는 변하지 않음
# 라벨 인코딩

(0    0
 1    0
 2    1
 3    1
 4    0
 Name: Sex, dtype: int64,
       Sex
 0    Male
 1    Male
 2  Female
 3  Female
 4    Male)

In [96]:
# inplace = True : df 를 바꿔준다
df['Sex'].replace( {'Male':0, 'Female':1}, inplace=True )
df

   Sex
0    0
1    0
2    1
3    1
4    0

## 그룹으로 묶기

In [97]:
df = pd.DataFrame({'key':['A','B','C','A','B','C'],
                   'data1': range(6),
                   'data2': np.random.randint(1,10,6)
                   })
df

  key  data1  data2
0   A      0      3
1   B      1      2
2   C      2      1
3   A      3      8
4   B      4      8
5   C      5      2

In [98]:
# group by : 뒤에 집계함수 적용해야한다
df.groupby('key')

In [99]:
df.groupby('key').sum()

     data1  data2
key
A        3     11
B        5     10
C        7      3

In [100]:
df.groupby('key').mean()

     data1  data2
key
A      1.5    5.5
B      2.5    5.0
C      3.5    1.5

In [101]:
# 두개의 그룹으로 묶는다
df.groupby(['key','data1']).sum()

           data2
key data1
A   0          3
    3          8
B   1          2
    4          8
C   2          1
    5          2

In [102]:
# aggregate : 집계를 한번해 하는 방법
# aggregate(['집계함수','집계함수'...])
# aggregate({'칼럼명':'집계함수','칼럼명':'집계함수'})
df.groupby('key').aggregate(['min','mean','max'])

    data1          data2
      min mean max   min mean max
key
A       0  1.5   3     3  5.5   8
B       1  2.5   4     2  5.0   8
C       2  3.5   5     1  1.5   2

In [103]:
df.groupby('key').aggregate(['min','median','max'])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    5.5   8
B       1    2.5   4     2    5.0   8
C       2    3.5   5     1    1.5   2

In [104]:
df.groupby('key').aggregate({'data1':'mean','data2':'median'})

     data1  data2
key
A      1.5    5.5
B      2.5    5.0
C      3.5    1.5

In [105]:
data = {
    'Group' : ['A','B','A','B','A','B','A','B'],
    'data1' : [20,30,40,20,30,40,30,50],
    'data2' : list(range(1,9))
}

df = pd.DataFrame(data)
df

  Group  data1  data2
0     A     20      1
1     B     30      2
2     A     40      3
3     B     20      4
4     A     30      5
5     B     40      6
6     A     30      7
7     B     50      8

In [106]:
df.groupby('Group').aggregate(['min','median','max'])

      data1            data2
        min median max   min median max
Group
A        20   30.0  40     1    4.0   7
B        20   35.0  50     2    5.0   8

In [107]:
df.groupby('Group').aggregate({'data1':'sum','data2':'sum'})

       data1  data2
Group
A        120     16
B        140     20

In [114]:
# filter  데이터 필터링
# 그룹으로 묶은 상태에서 그룹 속성을 기준으로 데이터 필터링

def filter_mean(x):
    return x['data2'].mean() > 3

df.groupby('Group').mean(),df.groupby('Group').filter(filter_mean)

(       data1  data2
 Group
 A       30.0    4.0
 B       35.0    5.0,
   Group  data1  data2
 0     A     20      1
 1     B     30      2
 2     A     40      3
 3     B     20      4
 4     A     30      5
 5     B     40      6
 6     A     30      7
 7     B     50      8)

In [115]:
# apply 
# group by 를 통해 묶인 데이터에 함수 적용 
# ex) 주식 데이터 
df.groupby('Group').apply(lambda x: x.max() - x.min())

       data1  data2
Group
A         20      6
B         30      6

In [116]:
# get_group
# group by 로 묶인 데이터에서 key 값으로 데이터 가져오기
df.groupby('Group').get_group('A')

  Group  data1  data2
0     A     20      1
2     A     40      3
4     A     30      5
6     A     30      7

In [129]:
# muli index
# index 를 계층으로 구성

df =pd.DataFrame(
    np.random.randn(4,2),
    index= [ ['A','A','B','B'],[1,2,1,2] ],
    columns=['Data1','Data2']
)
df

        Data1     Data2
A 1 -1.505940 -0.075171
  2  1.015100 -2.037751
B 1 -1.061186 -0.099532
  2 -1.438622  0.048278

In [130]:
df_col = pd.DataFrame(
    np.random.randn(4,4),
    columns=[ ['A','A','B','B'], ['1','2','1','2'] ] # 열 형식으로도 만들 수 있다
)
df_col

          A                   B
          1         2         1         2
0 -0.219886  0.676212 -1.526219  0.206649
1  0.316983 -0.287915  1.126595  1.967764
2  0.232892  1.483512 -1.153769 -1.353728
3  0.617499  0.935550 -0.279019  0.037069

In [131]:
df_col['A']

          1         2
0 -0.219886  0.676212
1  0.316983 -0.287915
2  0.232892  1.483512
3  0.617499  0.935550

In [132]:
df_col['A']['1']

0   -0.219886
1    0.316983
2    0.232892
3    0.617499
Name: 1, dtype: float64

In [133]:
# pivot_table
# index : 행 index , 들어갈 key
# columns : 열 index , 라벨링 되는 값 
# values : 분석할 데이터 값

df

        Data1     Data2
A 1 -1.505940 -0.075171
  2  1.015100 -2.037751
B 1 -1.061186 -0.099532
  2 -1.438622  0.048278

In [150]:
data = {
    "날짜": ["2020-01-01", "2020-01-01", "2020-01-01", "2020-01-02", "2020-01-02", "2020-01-02"],
    "카테고리": ["과일", "채소", "채소", "과일", "과일", "채소"],
    "수량": [10, 15, 5, 20, 10, 5],
    "판매처" : ['서울','부산','대전','제주','전주','광주'],
    "테스트":[1,2,3,3,1,2]
}
df = pd.DataFrame(data)
df

           날짜 카테고리  수량 판매처  테스트
0  2020-01-01   과일  10  서울    1
1  2020-01-01   채소  15  부산    2
2  2020-01-01   채소   5  대전    3
3  2020-01-02   과일  20  제주    3
4  2020-01-02   과일  10  전주    1
5  2020-01-02   채소   5  광주    2

In [147]:
df.pivot_table(
    index='날짜',
    columns='카테고리',
    values='수량',
    aggfunc=['mean','sum']
)

            mean       sum
카테고리          과일    채소  과일  채소
날짜
2020-01-01  10.0  10.0  10  20
2020-01-02  15.0   5.0  30   5

In [151]:
df.pivot_table(
    index='날짜',
    columns='카테고리',
    values=['수량','테스트'],
    aggfunc='mean'
)

              수량        테스트
카테고리          과일    채소   과일   채소
날짜
2020-01-01  10.0  10.0  1.0  2.5
2020-01-02  15.0   5.0  2.0  2.0

In [155]:
df.pivot_table(
    index='날짜',
    columns=['카테고리','판매처'],
    values='수량',
    aggfunc='mean',
    
)

카테고리          과일               채소
판매처           서울    전주    제주   광주   대전    부산
날짜
2020-01-01  10.0   NaN   NaN  NaN  5.0  15.0
2020-01-02   NaN  10.0  20.0  5.0  NaN   NaN

In [156]:
df.pivot_table(
    index='날짜',
    columns=['카테고리','판매처'],
    values='수량',
    aggfunc='mean',
    fill_value=0
)

카테고리          과일               채소
판매처           서울    전주    제주   광주   대전    부산
날짜
2020-01-01  10.0   0.0   0.0  0.0  5.0  15.0
2020-01-02   0.0  10.0  20.0  5.0  0.0   0.0